from loom.__version__ import version  # type: ignore

BANNER = """
 ██▓     ▒█████   ▒█████   ███▄ ▄███▓
▓██▒    ▒██▒  ██▒▒██▒  ██▒▓██▒▀█▀ ██▒
▒██░    ▒██░  ██▒▒██░  ██▒▓██    ▓██░
▒██░    ▒██   ██░▒██   ██░▒██    ▒██
░██████▒░ ████▓▒░░ ████▓▒░▒██▒   ░██▒
░ ▒░▓  ░░ ▒░▒░▒░ ░ ▒░▒░▒░ ░ ▒░   ░  ░
░ ░ ▒  ░  ░ ▒ ▒░   ░ ▒ ▒░ ░  ░      ░
  ░ ░   ░ ░ ░ ▒  ░ ░ ░ ▒  ░      ░
    ░  ░    ░ ░      ░ ░         ░
               {version}
           KANISHK NAVALE
"""

if __name__ == "__main__":
    print(BANNER.format(version=version))
